{
    "page": 1,
    "perPage": 30,
    "totalItems": 13,
    "totalPages": 1,
    "items": [
        {
            "collectionId": "bgk5y23xc0gukrk",
            "collectionName": "degree_modules",
            "created": "2024-09-04 15:26:05.889Z",
            "id": "d8mlx9dxasta9hm",
            "module_content": "<p>For my final year project, I built a multi-tier, client-server image management web application, which had a Vue.js/Taiwind front end, a Python/Flask server with facial detection and recognition capabilities (using DeepFace), and a MySQL database for application data storage.</p>\r\n<p>The application's main functionalities included an image upload facility that performs facial detection and recognition steps, automatic image tagging based on pre-learned faces, or manual tagging for unknown faces, facial profile building with sequential recognition steps, a search feature for finding images of a certain person (known to the database) by name, and a main gallery.</p>",
            "module_id": "FYP",
            "module_level": 6,
            "module_title": "Final Year Project",
            "module_year": 3,
            "updated": "2024-09-04 23:09:04.913Z"
        },
        {
            "collectionId": "bgk5y23xc0gukrk",
            "collectionName": "degree_modules",
            "created": "2024-09-04 15:26:39.493Z",
            "id": "bwfe6ori753mom1",
            "module_content": "<p>The first part of this module built further on the server side programming module, revisiting SOLID principles, unit testing, and looking deeper into design patterns, refactoring and clean architecture.</p><p>The second part of the module focused on concurreny in C#, looking at threads, synchronisation, and thread safety. I also looked at network sockets, serialisation and client-server communication using mulit-threading, architectural tiers and layes, and transactions.</p>",
            "module_id": "CCCP",
            "module_level": 6,
            "module_title": "Clean Coding and Concurrent Programming",
            "module_year": 3,
            "updated": "2024-09-05 15:56:02.504Z"
        },
        {
            "collectionId": "bgk5y23xc0gukrk",
            "collectionName": "degree_modules",
            "created": "2024-09-04 15:27:07.541Z",
            "id": "cmjs6wzdg8u9bw7",
            "module_content": "<p>This module was focused on client-side and server-side frameworks. I looked at MVC/Laravel and Wordpress with WooCommerce and custom themes on the server-side, and learned how to build a single page application (SPA) with Vue.js with Tailwind CSS.</p>",
            "module_id": "DWF",
            "module_level": 6,
            "module_title": "Developing With Web Frameworks",
            "module_year": 3,
            "updated": "2024-09-05 15:45:37.536Z"
        },
        {
            "collectionId": "bgk5y23xc0gukrk",
            "collectionName": "degree_modules",
            "created": "2024-09-04 15:27:40.505Z",
            "id": "8ajs2l5jdwjrqyb",
            "module_content": "<p>In this module I looked at current web technologies including Typescript, WebAPIs, CSS advancements, and web frameworks including Vue.js, React and Tailwind.</p><p>I also looked at how A.I. is currently being used on the Web, integrated into existing platforms, and used to strealine the developement of new technologies and applications.</p>",
            "module_id": "WAI",
            "module_level": 6,
            "module_title": "Web and Artificial Intelligence",
            "module_year": 3,
            "updated": "2024-09-05 15:38:02.093Z"
        },
        {
            "collectionId": "bgk5y23xc0gukrk",
            "collectionName": "degree_modules",
            "created": "2024-09-04 15:28:13.662Z",
            "id": "vqyhs7t8ve0tw7i",
            "module_content": "<p>In this module I learned about artificial intelligence and its subsets of machine learning and deep learning. I learned about machine learning approaches including supervised, unsupervised and reinforcement learning. I also looked at data analysis types like classification, regression and clustering. I learned about data sets and normalisation and feature selection as well as machine learning algorithms including kNN, Linear Regression, Decision Trees and deep learning with Neural Networks.</p><p>For this module I produced a number of machine learning models in Python on Google Colab using different algorithms and techniques to compare them for suitabilty in analysing a given dataset.</p>",
            "module_id": "IAI",
            "module_level": 4,
            "module_title": "Introduction to Artificial Intelligence",
            "module_year": 2,
            "updated": "2024-09-05 15:25:42.445Z"
        },
        {
            "collectionId": "bgk5y23xc0gukrk",
            "collectionName": "degree_modules",
            "created": "2024-09-04 15:28:55.999Z",
            "id": "6m31c6vb0g8y9ei",
            "module_content": "<p>This module built on the Software Development and Application Modelling module concepts. I learned about MCV frameworks and built applications using both PHP and Java using the Laravel and Spring Boot frameworks. In Spring Boot I learned to build simple HTML and RESTful API applications, and used this concept to build a back-office application for a Laravel website.</p><p>I also learned about unit testing in this module, planning using test cases with normal, valid and boundary values and special cases, and executing these via a test plan. In this module, I also learned about software design patterns and good coding practices including DRY and SOLID principles.</p>",
            "module_id": "SSP",
            "module_level": 5,
            "module_title": "Server Side Programming",
            "module_year": 2,
            "updated": "2024-09-05 15:40:07.277Z"
        },
        {
            "collectionId": "bgk5y23xc0gukrk",
            "collectionName": "degree_modules",
            "created": "2024-09-04 15:29:39.212Z",
            "id": "kdf36ze602kddgk",
            "module_content": "<p>In this module I learned how to build a database using Oracle SQL tables, sequences, procedures and triggers. I also learned how to build varying complexities of queries, and built a visualisation system for specific queries in Python which produced Google Charts HTML outputs.</p><p>I also learned about building algorithms with pseudocode and evaluating their performance using Big O notation to calculate the time/space complexity. For this module implmented a Java application which used dijkstra's algorithm to calcualte a shortest path through a graphs nodes between 2 set points.</p>",
            "module_id": "DDS",
            "module_level": 5,
            "module_title": "Databases and Data Structures",
            "module_year": 2,
            "updated": "2024-09-05 14:43:03.352Z"
        },
        {
            "collectionId": "bgk5y23xc0gukrk",
            "collectionName": "degree_modules",
            "created": "2024-09-04 15:30:06.482Z",
            "id": "4puvss7g3bybs9v",
            "module_content": "<p>In this module I studied application development for mobile platforms. I looked at native development for Android using Kotlin in Android Studio, cross-platform transpiling development using Dart and the Flutter framework, and mobile web by building progressive web applications (PWA) conforming to lighthouse tests.</p><p>One of the projects for this module was to build a mobile application with 2 different technologies which adhered to the Material 3 design system and looked the same in both technologies.</p>  ",
            "module_id": "MAD",
            "module_level": 5,
            "module_title": "Mobile App Development",
            "module_year": 2,
            "updated": "2024-09-05 14:22:58.047Z"
        },
        {
            "collectionId": "bgk5y23xc0gukrk",
            "collectionName": "degree_modules",
            "created": "2024-09-04 15:30:31.262Z",
            "id": "i9lmr4gnok505q4",
            "module_content": "<p>This module was focussed on career focused topics including career planning, CV building, professional profile building via relevant social platforms, interviewing techniques and included a live group project working on a brief for a client including a proposal stage and final presentation of the project report and artefact.</p>",
            "module_id": "CC",
            "module_level": 5,
            "module_title": "Commercial Computing",
            "module_year": 2,
            "updated": "2024-09-05 14:15:57.307Z"
        },
        {
            "collectionId": "bgk5y23xc0gukrk",
            "collectionName": "degree_modules",
            "created": "2024-09-04 15:30:58.596Z",
            "id": "36k3mimscszt5y9",
            "module_content": "<p>In the first part of this module I learned procedural Python language fundamentals of sequence, selction and iteration incuding data types, control structures, loops and functions.</p><p>In the second half of the module I learned object-oriented C#, building on procedural knowledge with OO concepts such as encapsulation, inheritence, polymorphism and the language features of classes, interfaces and abstraction. I also learned about SOLID principles, UML modelling, from building a requirements list to modelling the application with use case, activity, analysis, class and sequence diagrams.</p>",
            "module_id": "SDAM",
            "module_level": 4,
            "module_title": "Software Development and Application Modelling",
            "module_year": 1,
            "updated": "2024-09-05 14:12:01.921Z"
        },
        {
            "collectionId": "bgk5y23xc0gukrk",
            "collectionName": "degree_modules",
            "created": "2024-09-04 15:31:28.343Z",
            "id": "r38m0u5h0yiey12",
            "module_content": "<p>The first part of this module was learning linux; I learned about distributions, installation, installing software packages, command line and shell scripting.</p><p> I also learned about virtualisation using HyperV, VirtualBox and VMware. The second part of this module focused on web authoring fundamentals including HTML, CSS and JavaScript.</p>",
            "module_id": "WDOS",
            "module_level": 4,
            "module_title": "Web Development and Operating Systems",
            "module_year": 1,
            "updated": "2024-09-05 13:38:33.386Z"
        },
        {
            "collectionId": "bgk5y23xc0gukrk",
            "collectionName": "degree_modules",
            "created": "2024-09-04 15:32:01.164Z",
            "id": "xwawztj3o68vgf6",
            "module_content": "<p>The first half of this module covered networking and covered networking concepts including OSI and TCP-IP, LAN, WAN, PAN. I had the chance to work hands on with Cisco switches and routers, including completing configuration tasks in Cisco IOS for switching and routing setups. The assignment project for this section was to create design and implement a 3 site WAN with multiple end devices, switches and routers (all with live configurations) using Cisco Packet Tracer.</p><p>The second half of the module was focussed on cyber security topics, including law and standards, cryptography, security policy, threat assessment and identification. The assignment for this section was a group research report on a security scenario.</p>",
            "module_id": "NCCS",
            "module_level": 4,
            "module_title": "Network Concepts and Cyber Security",
            "module_year": 1,
            "updated": "2024-09-05 11:31:00.977Z"
        },
        {
            "collectionId": "bgk5y23xc0gukrk",
            "collectionName": "degree_modules",
            "created": "2024-09-04 15:32:27.343Z",
            "id": "t5344k8t996unv0",
            "module_content": "<p>In this introductory modue, I covered computing fundamental topics including architectures, hardware, software, networking, cloud concepts.</p><p>The second half of the module covered computing mathematics, including liner algebra, statistics and calculus.</p>",
            "module_id": "DT",
            "module_level": 4,
            "module_title": "Digital Technologies",
            "module_year": 1,
            "updated": "2024-09-05 11:06:35.169Z"
        }
    ]
}